Конфигурация/Catalogs/УровниДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>УровниДоступа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистрация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧтениеБезОграничения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеБезОграничения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/НастройкиДоступаВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. описание одноименной функции модуля НастройкиДоступаКлиентСерверПовтИсп.
// 
Функция ПриоритетыУровнейДоступа(ДляЛокальныхАдминистраторов = Ложь) Экспорт
	
	ПриоритетыУровнейДоступа = Новый Соответствие;
	ПриоритетыУровнейДоступа.Вставить(0, 
		ПредопределенноеЗначение("Справочник.УровниДоступа.ПустаяСсылка"));
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УровниДоступа.Ссылка,
		|	УровниДоступа.Приоритет
		|ИЗ
		|	Справочник.УровниДоступа КАК УровниДоступа
		|ГДЕ
		|	НЕ УровниДоступа.ПометкаУдаления
		|	И УровниДоступа.ЧтениеБезОграничения = &ДляЛокальныхАдминистраторов");
		
	Запрос.УстановитьПараметр("ДляЛокальныхАдминистраторов", ДляЛокальныхАдминистраторов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПриоритетыУровнейДоступа.Вставить(Выборка.Приоритет, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ПриоритетыУровнейДоступа;
	
КонецФункции

// См. описание одноименной функции модуля НастройкиДоступаКлиентСерверПовтИсп.
// 
Функция УровниДоступаВПорядкеПриоритетов(ДляЛокальныхАдминистраторов = Ложь) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УровниДоступа.Ссылка,
		|	УровниДоступа.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.УровниДоступа КАК УровниДоступа
		|ГДЕ
		|	НЕ УровниДоступа.ПометкаУдаления
		|	И УровниДоступа.ЧтениеБезОграничения = &ДляЛокальныхАдминистраторов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет");
		
	Запрос.УстановитьПараметр("ДляЛокальныхАдминистраторов", ДляЛокальныхАдминистраторов);
	
	УровниДоступаВПорядкеПриоритетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	УровниДоступаВПорядкеПриоритетов.Вставить(0,
		ПредопределенноеЗначение("Справочник.УровниДоступа.ПустаяСсылка"));
	
	Возврат УровниДоступаВПорядкеПриоритетов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
